trezor/trezor-firmware/core/embed/sdk/nrf52/components/libraries/mem_manager/mem_manager.c
        column_number++;
        const uint32_t column_end = (column_number * PRINT_COLUMN_WIDTH);

        for (int j = 0; j < column_end; j ++)
        {
            if (print_buffer[j] == 0)
            {
                print_buffer[j] = 0x20;
            }
        }
        snprintf(&print_buffer[column_end], 2, "|");

        NRF_LOG_INFO("%s", print_buffer);

        (*p_mem_in_use) += in_use;
    }
}


void nrf_mem_diagnose(void)
{
    uint32_t in_use = 0;

    NRF_LOG_INFO("");
    NRF_LOG_INFO("+------------+------------+------------+------------+------------+------------+");
    NRF_LOG_INFO("| Block      | Size       | Total      | In Use     | Min Alloc  | Max Alloc  |");
    NRF_LOG_INFO("+------------+------------+------------+------------+------------+------------+");

    print_block_info(BLOCK_CAT_XXS, &in_use);
    print_block_info(BLOCK_CAT_XS, &in_use);
    print_block_info(BLOCK_CAT_SMALL, &in_use);
    print_block_info(BLOCK_CAT_MEDIUM, &in_use);
    print_block_info(BLOCK_CAT_LARGE, &in_use);
    print_block_info(BLOCK_CAT_XL, &in_use);
    print_block_info(BLOCK_CAT_XXL, &in_use);

    NRF_LOG_INFO("+------------+------------+------------+------------+------------+------------+");
    NRF_LOG_INFO("| Total      | %d      | %d        | %d",
            TOTAL_MEMORY_SIZE, TOTAL_BLOCK_COUNT,in_use);
    NRF_LOG_INFO("+------------+------------+------------+------------+------------+------------+");
}


void nrf_mem_diagnose_reset(void)
{
    memcpy(&m_min_size, &m_min_size_default, sizeof(m_min_size));
    memset(&m_max_size, 0, sizeof(m_max_size));
    memset(&m_peak_count, 0, sizeof(m_max_count));
    memset(&m_cur_count, 0, sizeof(m_cur_count));
}

#endif // MEM_MANAGER_ENABLE_DIAGNOSTICS
/** @} */
#endif //NRF_MODULE_ENABLED(MEM_MANAGER)

